$(document).ready(function() {
	var DATA = {
		'福建': [
			'[999]感冒灵颗粒',
			'[健途]维生素C咀嚼片',
			'[999]感冒清热颗粒',
			'[汇仁]肾宝片',
			'[金毓婷]左炔诺孕酮片',
			'[丹媚]左炔诺孕酮肠溶片',
			'[仁和]益气养血口服液',
			'[健途]甜橙味多种维生素泡腾片',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[仁和]六味地黄丸（浓缩丸）',
		],
		'西藏': [
			'[朗依]硝呋太尔制霉素阴道软胶囊',
			'[达克宁]硝酸咪康唑阴道软胶囊',
			'[同仁堂]加味逍遥丸',
		],
		'贵州': [
			'[汇仁]肾宝片',
			'[金毓婷]左炔诺孕酮片',
			'[999]感冒灵颗粒',
			'[汤臣倍健]液体钙软胶囊',
			'[汤臣倍健]蛋白粉',
			'[汇仁]肾宝合剂',
			'[汤臣倍健]维生素B族片',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[感康]复方氨酚烷胺片',
			'[九芝堂]驴胶补血颗粒',
		],
		'上海': [
			'[999]复方感冒灵颗粒',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[金毓婷]左炔诺孕酮片',
			'鸿茅药酒',
			'[仁和可立克]复方氨酚烷胺胶囊',
			'[鸿茅]鸿茅药酒',
			'[济川]蒲地蓝消炎口服液',
			'[汇仁]肾宝片',
			'[快克]复方氨酚烷胺胶囊',
			'[999]感冒灵颗粒',
		],
		'广东': [
			'[999]感冒灵颗粒',
			'[汇仁]肾宝片',
			'[金毓婷]左炔诺孕酮片',
			'[万艾可]枸橼酸西地那非片',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[仁和]益气养血口服液',
			'[白云山]小柴胡颗粒',
			'[健途]维生素C咀嚼片',
			'[同仁堂]京制牛黄解毒片',
			'金嗓子喉片',
		],
		'湖南': [
			'[古汉]古汉养生精口服液',
			'[济川]蒲地蓝消炎口服液',
			'[金毓婷]左炔诺孕酮片',
			'[999]感冒灵颗粒',
			'古汉养生精口服液(古汉养生精)',
			'[汇仁]肾宝片',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[守护神]百艾洗液',
			'[汤臣倍健]液体钙软胶囊',
			'[九芝堂]驴胶补血颗粒',
		],
		'湖北': [
			'[999]感冒灵颗粒',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[汇仁]肾宝片',
			'[万艾可]枸橼酸西地那非片',
			'[爱乐维]复合维生素片',
			'[金毓婷]左炔诺孕酮片',
			'[感康]复方氨酚烷胺片',
			'[午时]金银花露',
			'[施慧达]苯磺酸左旋氨氯地平片',
			'[顺尔宁]孟鲁司特钠片',
		],
		'香港': [
			'[999]感冒灵颗粒',
			'[扶他林]双氯芬酸钠肠溶片',
		],
		'四川': [
			'[999]感冒灵颗粒',
			'[汇仁]肾宝片',
			'[金毓婷]左炔诺孕酮片',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[汤臣倍健]液体钙软胶囊',
			'[万艾可]枸橼酸西地那非片',
			'[感康]复方氨酚烷胺片',
			'[济川]蒲地蓝消炎口服液',
			'[澳诺]葡萄糖酸钙锌口服溶液',
			'[汤臣倍健]蛋白粉',
		],
		'安徽': [
			'[仁和]益气养血口服液',
			'[妇炎洁]银离子妇用抗菌凝胶',
			'[健途]维生素C咀嚼片',
			'[汇仁]肾宝片',
			'[仁和]宫炎康颗粒',
			'[达芙通]地屈孕酮片',
			'[健途]西洋参淫羊藿枸杞子提取物马鹿茸软胶囊',
			'[仁和]六味地黄丸（浓缩丸）',
			'[金毓婷]左炔诺孕酮片',
			'[健途]甜橙味多种维生素泡腾片',
		],
		'新疆': [
			'[汇仁]肾宝片',
			'[万艾可]枸橼酸西地那非片',
			'[健途]西洋参淫羊藿枸杞子提取物马鹿茸软胶囊',
			'[必利劲]盐酸达泊西汀片',
			'[开浦兰]左乙拉西坦片',
			'[仁和]肾脾双补口服液',
			'[爱乐维]复合维生素片',
			'[健途]甜橙味多种维生素泡腾片',
			'[广誉远]龟龄集',
			'[健途]维生素C咀嚼片',
		],
		'江苏': [
			'京都念慈菴蜜炼川贝枇杷膏',
			'[汇仁]肾宝片',
			'[金毓婷]左炔诺孕酮片',
			'[999]感冒灵颗粒',
			'[济川]蒲地蓝消炎口服液',
			'[万艾可]枸橼酸西地那非片',
			'[快克]复方氨酚烷胺胶囊',
			'[999]复方感冒灵颗粒',
			'[感康]复方氨酚烷胺片',
			'[恩威]洁尔阴洗液',
		],
		'吉林': [
			'[汇仁]肾宝片',
			'[万艾可]枸橼酸西地那非片',
			'[金毓婷]左炔诺孕酮片',
			'[感康]复方氨酚烷胺片',
			'[汤臣倍健]维生素B族片',
			'[修正]复方氨酚烷胺片',
			'[仁和]复方虫草口服液',
			'[仁和]益气养血口服液',
			'[妥泰]托吡酯片',
			'[迪巧]维D钙咀嚼片',
		],
		'宁夏': [
			'[仁和]益气养血口服液',
			'[仁和]六味地黄丸（浓缩丸）',
			'[妇炎洁]银离子妇用抗菌凝胶',
			'[汇仁]肾宝片',
			'[健途]西洋参淫羊藿枸杞子提取物马鹿茸软胶囊',
			'[广誉远]龟龄集',
			'[施强]复方玄驹胶囊',
			'[克龄蒙]戊酸雌二醇片/雌二醇环丙孕酮片复合包装',
			'[健途]维生素C咀嚼片',
			'[jintoo]立体防护口罩（带呼吸阀 N95 成人）',
		],
		'河南': [
			'[金毓婷]左炔诺孕酮片',
			'[999]感冒灵颗粒',
			'[济川]蒲地蓝消炎口服液',
			'[波立维]硫酸氢氯吡格雷片',
			'[汇仁]肾宝片',
			'[阿乐]阿托伐他汀钙片',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[立普妥]阿托伐他汀钙片 （新老包装，随机发货）',
			'[可定]瑞舒伐他汀钙片',
			'[仁和]益气养血口服液',
		],
		'河北': [
			'[汇仁]肾宝片',
			'[仁和]益气养血口服液',
			'[金毓婷]左炔诺孕酮片',
			'[jintoo]立体防护口罩（带呼吸阀 N95 成人）',
			'[万艾可]枸橼酸西地那非片',
			'[999]感冒灵颗粒',
			'[感康]复方氨酚烷胺片',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[健途]维生素C咀嚼片',
			'[阿乐]阿托伐他汀钙片',
		],
		'广西': [
			'[仁和]益气养血口服液',
			'[金毓婷]左炔诺孕酮片',
			'[丹媚]左炔诺孕酮肠溶片',
			'[健途]维生素C咀嚼片',
			'[999]感冒灵颗粒',
			'云南白药创可贴（便携型）',
			'金嗓子喉片',
			'[汇仁]肾宝片',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[万艾可]枸橼酸西地那非片',
		],
		'海南': [
			'[同仁堂]安宫牛黄丸（铁盒金衣）',
			'[仁和]六味地黄丸（浓缩丸）',
			'[健途]甜橙味多种维生素泡腾片',
			'[仁和]益气养血口服液',
			'[富露施]乙酰半胱氨酸泡腾片',
			'[雅塑]奥利司他胶囊',
			'[万托林]硫酸沙丁胺醇气雾剂',
			'[健途]维生素C咀嚼片',
			'[达英-35]炔雌醇环丙孕酮片',
			'[施强]复方玄驹胶囊',
		],
		'江西': [
			'[正大天晴]恩替卡韦分散片',
			'[汤臣倍健]液体钙软胶囊',
			'[养生堂]天然维生素E软胶囊',
			'[汇仁]肾宝片',
			'[999]感冒清热颗粒',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[汤臣倍健]维生素C片',
			'[养生堂]天然维生素C咀嚼片',
			'[999]感冒灵颗粒',
			'[福牌]阿胶（铁盒）',
		],
		'重庆': [
			'[济川]蒲地蓝消炎口服液',
			'[汇仁]肾宝片',
			'[999]感冒灵颗粒',
			'[汤臣倍健]液体钙软胶囊',
			'[万艾可]枸橼酸西地那非片',
			'[仁和]阿胶益寿口服液',
			'[仁和]益气养血口服液',
			'[太极]补肾益寿胶囊',
			'[曹清华]薏辛除湿止痛胶囊',
			'[感康]复方氨酚烷胺片',
		],
		'云南': [
			'[汇仁]肾宝片',
			'[健途]维生素C咀嚼片',
			'[薇美]私密紧致修护精华',
			'[仁和]五子衍宗丸',
			'[健途]西洋参淫羊藿枸杞子提取物马鹿茸软胶囊',
			'[仁和]珍妍养护贴',
			'[华佗]男宝胶囊',
			'[仁和]复方虫草口服液',
			'[万艾可]枸橼酸西地那非片',
			'[同仁堂]六味地黄丸（水蜜丸）',
		],
		'北京': [
			'[万艾可]枸橼酸西地那非片',
			'[济川]蒲地蓝消炎口服液',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[金毓婷]左炔诺孕酮片',
			'[999]感冒灵颗粒',
			'[jintoo]立体防护口罩（带呼吸阀 N95 成人）',
			'[汇仁]肾宝片',
			'[爱乐维]复合维生素片',
			'[感康]复方氨酚烷胺片',
			'[芬必得]布洛芬缓释胶囊',
		],
		'甘肃': [
			'[仁和]益气养血口服液',
			'[健途]西洋参淫羊藿枸杞子提取物马鹿茸软胶囊',
			'[万艾可]枸橼酸西地那非片',
			'[怡诺思]盐酸文拉法辛缓释胶囊',
			'[汇仁]肾宝片',
			'[健途]维生素C咀嚼片',
			'[施强]复方玄驹胶囊',
			'[必利劲]盐酸达泊西汀片',
			'[健途]复合益生菌固体饮料（仁和谓友）',
			'[仁和]六味地黄丸（浓缩丸）',
		],
		'陕西': [
			'[安琪坦]黄体酮软胶囊',
			'[波立维]硫酸氢氯吡格雷片',
			'[立普妥]阿托伐他汀钙片 （新老包装，随机发货）',
			'[达芙通]地屈孕酮片',
			'[汇仁]肾宝片',
			'[999]感冒灵颗粒',
			'[摩美得]气血和胶囊',
			'[阿乐]阿托伐他汀钙片',
			'[金毓婷]左炔诺孕酮片',
			'京都念慈菴蜜炼川贝枇杷膏',
		],
		'山东': [
			'[999]感冒灵颗粒',
			'[健途]维生素C咀嚼片',
			'[金毓婷]左炔诺孕酮片',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[济川]蒲地蓝消炎口服液',
			'[汤臣倍健]液体钙软胶囊',
			'[汇仁]肾宝片',
			'[万艾可]枸橼酸西地那非片',
			'[仁和]益气养血口服液',
			'[仙琚]左炔诺孕酮肠溶胶囊 ',
		],
		'浙江': [
			'京都念慈菴蜜炼川贝枇杷膏',
			'[汇仁]肾宝片',
			'[金毓婷]左炔诺孕酮片',
			'[999]感冒灵颗粒',
			'[万艾可]枸橼酸西地那非片',
			'[恩威]洁尔阴洗液',
			'[济川]蒲地蓝消炎口服液',
			'[999]复方感冒灵颗粒',
			'[感康]复方氨酚烷胺片',
			'[999]感冒清热颗粒',
		],
		'内蒙古': [
			'[络活喜]苯磺酸氨氯地平片',
			'[拜新同]硝苯地平控释片',
			'[拜唐苹]阿卡波糖片',
			'[格华止]盐酸二甲双胍片',
			'[汇仁]肾宝片',
			'[可定]瑞舒伐他汀钙片',
			'[仁和]益气养血口服液',
			'[开浦兰]左乙拉西坦片',
			'[同仁堂]西黄丸',
			'[优甲乐]左甲状腺素钠片',
		],
		'青海': [
			'[万艾可]枸橼酸西地那非片',
			'[仁和]复方虫草口服液',
			'[达芙通]地屈孕酮片',
			'[汇仁]肾宝片',
			'养生堂牌天然维生素C咀嚼片',
			'[九芝堂]驴胶补血颗粒',
			'养生堂牌天然维生素E软胶囊',
			'[优甲乐]左甲状腺素钠片',
			'[施慧达]苯磺酸左旋氨氯地平片',
			'[同仁堂]五子衍宗丸',
		],
		'辽宁': [
			'[拜新同]硝苯地平控释片',
			'[感康]复方氨酚烷胺片',
			'[金毓婷]左炔诺孕酮片',
			'[济川]蒲地蓝消炎口服液',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[999]感冒灵颗粒',
			'[汇仁]肾宝片',
			'红牛维生素功能饮料',
			'[鸿茅]鸿茅药酒',
			'[汤臣倍健]蛋白质粉',
		],
		'天津': [
			'[汇仁]肾宝片',
			'[999]感冒灵颗粒',
			'[济川]蒲地蓝消炎口服液',
			'[金毓婷]左炔诺孕酮片',
			'[济川]小儿豉翘清热颗粒',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[感康]复方氨酚烷胺片',
			'[江中]健胃消食片（成人）',
			'[拜新同]硝苯地平控释片',
			'[爱乐维]复合维生素片',
		],
		'黑龙江': [
			'[三精]双黄连口服液',
			'[金纳多]银杏叶提取物片',
			'[金毓婷]左炔诺孕酮片',
			'[感康]复方氨酚烷胺片',
			'[波立维]硫酸氢氯吡格雷片',
			'[拜新同]硝苯地平控释片',
			'[仁和]益气养血口服液',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[江中]健胃消食片（成人）',
			'[济川]蒲地蓝消炎口服液',
		],
		'山西': [
			'[汇仁]肾宝片',
			'[金毓婷]左炔诺孕酮片',
			'[健途]维生素C咀嚼片',
			'[仁和]益气养血口服液',
			'[施慧达]苯磺酸左旋氨氯地平片',
			'[999]感冒灵颗粒',
			'[同仁堂]七宝美髯丸',
			'京都念慈菴蜜炼川贝枇杷膏',
			'[健途]甜橙味多种维生素泡腾片',
			'[汤臣倍健]蛋白粉',
		],
	};

	var height = $('#map').parent().height();
	if(IS_MOBILE){
		height = $('#map').width();
		$('#map').css('margin-bottom','20px');
	}
	$('#map').height(height);
	
	var titleSize = height * 0.0017;
	var textSize = height * 0.00125;
	
	if($('#map').width()>height){
		titleSize = $('#map').width() * 0.0017;
		textSize = $('#map').width() * 0.00125;
	}
	
	var getData = function(a0) {
		if(titleSize<0.8)
			titleSize = 0.8;
		if(textSize<0.6)
			textSize = 0.6;
		if(DATA[a0] == undefined) {
			return 	"<p style='text-align: left;font-size: "+titleSize+"em;'>" + a0 + "</p>" +
					"<p style='text-align: left;font-size: "+textSize+"em;'>该区域没有数据</p>";
		}
		var res = 	"<p style='text-align: left;font-size: "+titleSize+"em;'>" + a0 + "</p>" +
					"<table style='text-align: left;font-size: "+textSize+"em;'>";
		for(var i = 0;i<DATA[a0].length;i++){
			if(i%2==0){
				res +=	"<tr>" +
						"<td>" + (i+1) + "." + DATA[a0][i] + "&emsp;</td>";
			}else{
				res +=	"<td>" + (i+1) + "." + DATA[a0][i] + "</td>" +
						"</tr>";
			}
		}
		if((DATA[a0].length-1)%2==0){
			res += "</tr>";
		}
		res += "</table>";
		return res;
	};

	var myChart = echarts.init(document.getElementById('map'));
	var option = {
			backgroundColor: '#FFFFFF00',
			tooltip: {
				trigger: 'item',
				formatter: function(params, ticket, callback) {
					return getData(params.name);
				}
			},
			series: [{
				name: 'Title',
				type: 'map',
				mapType: 'china',
				roam: false,
				showLegendSymbol: false,
				data:[
	                {name: '北京',itemStyle:{normal:{areaColor:'#f1e788'}} },
	                {name: '重庆',itemStyle:{normal:{areaColor:'#b0baf8'}} },
	                {name: '河北',itemStyle:{normal:{areaColor:'#f1e788'}} },
	                {name: '河南',itemStyle:{normal:{areaColor:'#4ef1ec'}} },
	                {name: '黑龙江',itemStyle:{normal:{areaColor:'#4ef1ec'}} },
	                {name: '湖南',itemStyle:{normal:{areaColor:'#ddc3cc'}} },
	                {name: '江西',itemStyle:{normal:{areaColor:'#a7cfc6'}} },
	                {name: '湖北',itemStyle:{normal:{areaColor:'#b0baf8'}} },
	                {name: '内蒙古',itemStyle:{normal:{areaColor:'#4ef1ec'}} },
	                {name: '陕西',itemStyle:{normal:{areaColor:'#ddde00'}} },
	                {name: '西藏',itemStyle:{normal:{areaColor:'#edd4fe'}} },
	                {name: '四川',itemStyle:{normal:{areaColor:'#b0baf8'}} },
	                {name: '宁夏',itemStyle:{normal:{areaColor:'#f1e788'}} },
	                {name: '海南',itemStyle:{normal:{areaColor:'#b0baf8'}} }
	            ],
				label: {
					normal: {
						show: true,
						textStyle:{
							fontWeight:'bold'
						}
					},
					emphasis: {
						show: true,
						textStyle:{
							fontWeight:'bold'
						}
					}
				}
			}],
	};
	
	if($('#map').width()>height){
		option.series[0].top = '2%';
		option.series[0].bottom = '2%';
	}else{
		option.series[0].left = '2%';
		option.series[0].right = '2%';
	}
	
	if(IS_MOBILE){
		option.series[0].label.normal.textStyle.fontSize = height/49.3;
		option.series[0].label.emphasis.textStyle.fontSize = height/40;
		option.series[0].roam = true;
		option.series[0].scaleLimit = {
			min:1,
			max:4
		};
		option.tooltip.triggerOn = 'click';
		option.tooltip.position = ['0%','85%'];
	}
	
	// 使用刚指定的配置项和数据显示图表。
	myChart.setOption(option);
});